import networkx as nx
import matplotlib.pyplot as plt

# Створюємо граф
G = nx.DiGraph()

# Додаємо ребра з пропускною здатністю
# edges = [
#     (0, 2, 15),  # Джерело 1 -> Проміжний Вузол 1
#     (0, 3, 10),  # Джерело 1 -> Проміжний Вузол 2
#     (1, 2, 20),  # Джерело 2 -> Проміжний Вузол 1
#     (2, 4, 10),  # Проміжний Вузол 1 -> Споживач 1
#     (2, 5, 5),  # Проміжний Вузол 1 -> Споживач 2
#     (3, 6, 15),  # Проміжний Вузол 2 -> Споживач 3
# ]


edges = [
    ("Термінал 1", "Склад 1", 25),
    ("Термінал 1", "Склад 2", 20),
    ("Термінал 1", "Склад 3", 15),
    ("Термінал 2", "Склад 3", 15),
    ("Термінал 2", "Склад 4", 30),
    ("Термінал 2", "Склад 2", 10),
    ("Склад 1", "Магазин 1", 15),
    ("Склад 1", "Магазин 2", 10),
    ("Склад 1", "Магазин 3", 20),
    ("Склад 2", "Магазин 4", 15),
    ("Склад 2", "Магазин 5", 10),
    ("Склад 2", "Магазин 6", 25),
    ("Склад 3", "Магазин 7", 20),
    ("Склад 3", "Магазин 8", 15),
    ("Склад 3", "Магазин 9", 10),
    ("Склад 4", "Магазин 10", 20),
    ("Склад 4", "Магазин 11", 10),
    ("Склад 4", "Магазин 12", 15),
    ("Склад 4", "Магазин 13", 5),
    ("Склад 4", "Магазин 14", 10),
]



# Додаємо всі ребра до графа
G.add_weighted_edges_from(edges)

# Позиції для малювання графа
pos = {
    # Верхній ряд — Магазини 1–6
    "Магазин 1": (0, 5),
    "Магазин 2": (1, 5),
    "Магазин 3": (2, 5),
    "Магазин 4": (3, 5),
    "Магазин 5": (4, 5),
    "Магазин 6": (5, 5),

    # 2-й ряд зверху — Склади 1–2
    "Склад 1": (2, 4),
    "Склад 2": (4, 4),

    # Середній ряд — Термінали
    "Термінал 1": (1, 3),
    "Термінал 2": (5, 3),

    # 4-й ряд — Склади 3–4
    "Склад 3": (2, 2),
    "Склад 4": (4, 2),

    # Нижній ряд — Магазини 7–14
    "Магазин 7": (0, 1),
    "Магазин 8": (1, 1),
    "Магазин 9": (2, 1),
    "Магазин 10": (3, 1),
    "Магазин 11": (4, 1),
    "Магазин 12": (5, 1),
    "Магазин 13": (6, 1),
    "Магазин 14": (7, 1)
}

# Малюємо граф
plt.figure(figsize=(10, 6))
nx.draw(
    G,
    pos,
    with_labels=True,
    node_size=2000,
    node_color="skyblue",
    font_size=10,
    font_weight="bold",
    arrows=True,
)
labels = nx.get_edge_attributes(G, "weight")
nx.draw_networkx_edge_labels(G, pos, edge_labels=labels)

# Відображаємо граф
plt.show()